{"pageProps":{"post":{"content":"<p>So so so! It's been a long time since I wrote the last post of this dusty blog about our promising studio logo. Ah... I remember those days, I was thinking that start being an indie developer would be easy, and it is if you do not do nothing about game dev...</p>\n<p>Well, this time I'm writing here to show you, whoever you are, wherever you are and whenever you read this...</p>\n<h3 style=\"text-align: center;\">OUR FIRST GAME!</h3>\n<p>Oh yeah! We have developed a <strong>complete game</strong> (sadly that game is not <em>The Seeker</em>) for the first time, and I'm pretty sure that this was unbelievable the day we started that development. The development of this game was made in a <a href=\"https://en.wikipedia.org/wiki/Game_jam\" rel=\"nofollow\"><strong>Game Jam</strong></a> organized by me 2 months before the proposed Game Jam date. And that's why I'm writing this post, to talk about that journey.</p>\n<h3 id=\"preparing-a-game-jam-with-friends\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#preparing-a-game-jam-with-friends\"><span class=\"icon icon-link\"></span></a>Preparing a Game Jam with Friends</h3>\n<p>You read right, our first Game Jam was organized with friends who also are developers.</p>\n<p>As I said I arranged the date with 2 months in advance to be sure that all this geeky people (6 in total) were able to lend their brains to develop some <em>entertainment program</em> in 2 days and a half (Probably that anticipation would had been lesser if Christmas wasn't in the middle).</p>\n<p>One of the most important thing of this process (from my point of view) was to make sure that the guys who were going to participate in the Game Jam did not see it as an obligation, focus it so that it is known that the <strong>main objective is to have fun and spend a good time with friends</strong>.</p>\n<p>The other thing of this process is to <strong>be sure that no one thought we were going to go with a pre-set topic</strong> (even the organizer), no resuming old development, no brilliant game ideas, no roles defined, just fun. From here it's just wait till the Game Jam weekend.</p>\n<h4 id=\"first-day-first-contact\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#first-day-first-contact\"><span class=\"icon icon-link\"></span></a>First Day First Contact</h4>\n<p>The time passed and the day came clean minds in a single house prepared to breed a little game! Sadly, only 3 of us were present that day, no problem, let's dev!</p>\n<p>So we started on Friday evening designing a way to get a game definition without pre-defined ideas. We cut a bunch of papers and created <strong>4 different decks</strong> with them. One with <strong>mechanics</strong> (jump, life, death, melee, shoot, loot, interactions with environment, etc.), other with <strong>topics</strong> (thriller, exploration, horror, adventure, sports, etc.) another one with <strong>visual themes</strong>, for this one we used <a href=\"http://www.stormdeck.com/\" rel=\"nofollow\">Stormdeck</a> that has good ideas (Steampunk, Future Tech, Pixel Art, Depict, Low Poly, etc.) and a last one with different <strong>color palettes</strong>, we also used Stormdeck for this one.</p>\n<p>Then we discarded the cards that we didn't like and finally we choose randomly one of each other creating groups, so for example we had a Sports game with teleporting in negative color. Starting from this groups we discarded a few and then we choosed 2 of the remaining.</p>\n<p>This is what we get!</p>\n<p><img src=\"/posts/assets/ghost-posts-images/2017/02/425806014_163168_8236750835511981787.jpg\" alt=\"\">\n<em><strong>Note:</strong> Some names are in Spanish because our native language is Español, amigo!</em></p>\n<p>From here we started to bake some <strong>very basic idea just using one topic and one mechanic</strong> leaving apart the visual content at the moment, just to do prototyping.</p>\n<p>At the moment we began to feel ok with the idea, we started the development over it.</p>\n<h4 id=\"everyone-paddling-with-the-same-paddle\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#everyone-paddling-with-the-same-paddle\"><span class=\"icon icon-link\"></span></a>Everyone Paddling with the same Paddle</h4>\n<p>One of the problem was that <strong>only 2 of us know the engine</strong> (<a href=\"http://unity3d.com/\" rel=\"nofollow\">Unity3D</a>) we were developing with for this game, so we started this process by doing <a href=\"https://en.wikipedia.org/wiki/Pair_programming\" rel=\"nofollow\">pair programming</a> (but this time 4 people programing) till the others started feeling comfortable with the engine.</p>\n<p>This was important for the team, the fact that anyone could did anything for the game (ones faster/better than others, but this did matter) gave the team freedom to choose their roles or to take decisions over the development actions.</p>\n<p>At the time someone first joined the game jam, if he had no idea of Unity, some of us did pair programing with him until he felt comfortable with the tool.</p>\n<h4 id=\"and-then-the-levels-come\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#and-then-the-levels-come\"><span class=\"icon icon-link\"></span></a>And then the Levels come</h4>\n<p>Once that we had <strong>something that a game designer could work with</strong>, all of us started making a level each one focusing on the mechanics and topics, we set a timer of 30 minutes to design a whole level with an extra 5 minutes to polishing. When the timer came to an end each one played other's level. This was amazing, each of us ended with something <strong>completely different and awesome</strong> even that we were using the same assets and the same mechanics. This process helped us to discover new ways to improve our levels by merging or reusing other's ideas.</p>\n<img src=\"/posts/assets/ghost-posts-images/2017/02/ItsAliveLevel.jpg\" alt=\"\">\n<p>During this <em>play testing</em> we point out the bugs detected. Then, we <strong>made a review of each level</strong>, What is the best of that level? What could be improved? What feelings does that level evoke?, etc.</p>\n<h4 id=\"arrange--make--design--play--review--repeat\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#arrange--make--design--play--review--repeat\"><span class=\"icon icon-link\"></span></a>Arrange > Make > Design > Play > Review > Repeat</h4>\n<p>So we improvised our <strong>brand new Game Jam Workflow</strong>:</p>\n<ol>\n<li>Define what assets and mechanics we would like to have on that iteration</li>\n<li>Develop/make those tools/assets and improve the current ones fixing bugs and adding features</li>\n<li>Design/improve a level with this new assets (don't work again in the same level you did last iteration, instead, work on other's level)</li>\n<li>Play/Test the new/modified levels</li>\n<li>Review the changes find bugs improvements and set the new things you would like to got the next iteration</li>\n<li>Repeat till you have time!</li>\n</ol>\n<h4 id=\"last-hours\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#last-hours\"><span class=\"icon icon-link\"></span></a>Last Hours</h4>\n<p>At the end of the weekend we had 6 different levels with a bunch of cool stuff so we spend the last hours of the Game Jam to polish all of this. No more new developments, just bug fixing, menus, music, sounds, sprites.</p>\n<p>In short, <strong>make it look like a finished game</strong>.</p>\n<p>And it was!</p>\n<img src=\"/posts/assets/ghost-posts-images/2017/02/ItsAliveLevel1.jpg\" alt=\"\">\n<h3 id=\"its-alive\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#its-alive\"><span class=\"icon icon-link\"></span></a>It's Alive</h3>\n<p>So we ended with a simple game that has bring us a lot of knowledge and fun for a whole weekend.</p>\n<img src=\"/posts/assets/ghost-posts-images/2017/02/ItsAliveMainMenu.jpg\" alt=\"\">\n<p>And that's true, <strong>Zombie Unicorn is alive!</strong> we are not so dead yet (do not pay attention to our logo as reference) and we are boiling those neurons to make the most juicy game soup you've ever taste. This was the push needed to make the studio oils its gears and start the magic.</p>\n<p>Stop the chatter and show the game!</p>\n<p><strong>Play it on <a href=\"https://zombie-unicorn.itch.io/its-alive\" rel=\"nofollow\">It's Alive itch.io page</a></strong></p>\n<h4 id=\"after-game-jam\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#after-game-jam\"><span class=\"icon icon-link\"></span></a>After Game Jam</h4>\n<p>After the Game Jam we did a retrospective about what we liked and what we want to improve for next times. The general feeling was to <strong>be proud of finish a game completely</strong> but due the lack of knowledge in the technologies used during the Game Jam it caused feelings of <strong>spending the time learning instead of developing</strong> losing the opportunity to improve more the game (from a more commercial point of view).</p>\n<h4 id=\"game-jam-gold-rules\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#game-jam-gold-rules\"><span class=\"icon icon-link\"></span></a>Game Jam Gold Rules</h4>\n<p>This is my personal opinion and it could be different from the participants of this game jam or other game creators, but from my point of view this are the <strong>rules to have a nice and fun Game Jam</strong>:</p>\n<ul>\n<li><strong>Do not pre-set anything before start</strong> about the game. Try to keep your mind clean before starting the Game Jam.</li>\n<li><strong>Use some method to get the specifications</strong> of the game, random preferably. Do not choose directly what game you want to make.</li>\n<li><strong>Iterate in very small time slots</strong>. For example, 1h of dev/making, 30min lvl design, 20min review and planification.</li>\n<li><strong>Do not focus in all the game specifications from the start</strong>. Start by picking and making only one mechanic and one topic and then build over this ones bit by bit.</li>\n<li><strong>Save last hours for polishing</strong>. Stop the development a few hours before the Game Jam ends to start polishing what you have, and make it look like a game.</li>\n</ul>\n<blockquote>\n<p><strong>Special thanks to the creators!</strong></p>\n<p><a href=\"https://twitter.com/mattogodoy\" rel=\"nofollow\">Matto</a>, <a href=\"https://twitter.com/depablobernat\" rel=\"nofollow\">Bernart</a>, <a href=\"https://twitter.com/victorgb6\" rel=\"nofollow\">Victor</a>, <a href=\"https://twitter.com/The_Pretender86\" rel=\"nofollow\">Carlos</a>, <a href=\"https://twitter.com/adriandelarosab\" rel=\"nofollow\">Adrian</a> and <a href=\"https://twitter.com/AlbertoFdzM\" rel=\"nofollow\">Alberto (me)</a></p>\n</blockquote>\n<p><strong>Good Game &#x26; Have Fun!</strong></p>","coverImage":null,"date":1486598400000,"draft":false,"summary":"So so so! It's been a long time since I wrote the last post of this dusty blog about our promising studio logo. Ah......","slug":"2017/02/our-first-game-jam-its-alive","title":"Our First Game (Jam) It's Alive!"}},"__N_SSG":true}