{"pageProps":{"post":{"content":"\n# P2D Devlog v0.3.0 Enemies and New Location\n\nThis is the third devlog of the project P2D (Name to be defined). The change of this version compared to [the previous one](http://genomagames.com/p2d-devlog-v0-2-0-polishing-and-destructibles/) are very interesting. There has been new features and mechanics with more polishing over actuals things.\n\n### TL;DR;\n\n- The player can now look up and down making the camera tilts\n- New countryish location\n- The game now has **enemies** each with different logics:\n  - Bats (caves)\n  - Boars (caves and country)\n- Add and improve particles among the game\n- More decoration on levels\n- Improve custom Physics logic\n- Improve camera system\n- Improve levels sprites (switch from 16 tiles tilesets to 47 tiles tilesets)\n- The player will not move when attacking\n- When the player suffers damage will be thrown away\n\n**Keep reading to see some GIFs!**\n\n### Details\n\nThis version has been focused on adding 2 different types of enemies and a state logic that manages their behavior. Also, there has been several improves to the player mechanics and in the environment including a new location.\n\n#### Enemies\n\nThe game now has some hostile NPCs, **bats and boars** , each one with a different logic, movements and attacks.\n\nThe enemies include a **state system** that could be used in the future for more types of NPCs ( **N** on **P** layable **C** haracters). This system manages the state of the NPCs in the game. A **state** is like when an enemy has detected the player, it passes from **neutral state** to **hostile state** and starts attacking the player.\n\nThe player now will encounter **boars** on some locations that will charge against if they see him.\n\n![Boar Enemy](https://i.imgur.com/gNdcpHy.gif)\n\nNow the caves are inhabited by bats, they will be sleeping hanging in the ceiling until the player gets closer, then they will chase the player until losing him.\n\n![Bat Enemy](https://i.imgur.com/sSccgWz.gif)\n\n![Enemies](https://media.giphy.com/media/4GY3obDxCho9HlJSRY/giphy.gif)\n\n#### Player Moves Improvements\n\nThe player mechanics have been improved for a more pleasant the gameplay and to make some things feel more natural according to the game.\n\nNow the player can look up and down (without moving) to see what is above or under him.\n\n![Player Looking Up and Down](https://media.giphy.com/media/4QEQxY4U8eiI37TtJG/giphy.gif)\n\nControls while jumping has changed, when the player is in the air can move and change his direction, slower than if he where in the ground, and the jump height can be altered depending on how long the jump button is pressed. This could change in the future but at this moment it feels pretty good.\n\n![Player Jumping](https://media.giphy.com/media/OPwxxuiO1icr69DJsR/giphy.gif)\n\nIf the player attacks while moving he will stop moving to land the attack.\n\n![Player Moving and Attacking](https://media.giphy.com/media/1itJg84KaGIU3ANiGr/giphy.gif)\n\nIf the player takes damage he will be thrown away at the incoming attack direction.\n\n![Player Taking Damage](https://media.giphy.com/media/9DcC8MtQxbg9LNEvrc/giphy.gif)\n\n#### Improves in Camera System\n\nNow the camera switch side when the player alters his looking direction.\n\n![Player Changing Camera Direction](https://media.giphy.com/media/p43W9QFKQxsPyyIUeh/giphy.gif)\n\n#### New Game Country Location\n\nNow there is a new set of sprites to create countryish locations!\n\n![Country Location](https://media.giphy.com/media/ozjF8ZMxh17T5JMy2n/giphy.gif)\n\n### What's Next?\n\n- First history based levels\n- Public **Alpha Game Release**\n- More enemies\n- Attack while jumping\n- Polishing\n\n### Stay Tuned\n\nYou can follow the project progress on [@GenomaGames](https://twitter.com/GenomaGames)\n\n<!--kg-card-end: markdown-->\n","coverImage":null,"date":1537660800000,"draft":false,"excerpt":"This is the third devlog of the project P2D (Name to be defined). The change of this version compared to the previous...","slug":"2018/09/p2d-devlog-v0-3-0-enemies-and-new-location","title":"P2D Devlog v0.3.0 Enemies and New Location"}},"__N_SSG":true}