{"pageProps":{"currentPage":2,"posts":[{"content":"\n# A change of face\n\nWell it is time to announce a change of name to a nicer one!\n\nYou probably don't know but before \"Genoma Games\", we were called \"Zombie Unicorn Studio\".\n","coverImage":null,"date":1523923200000,"draft":false,"summary":"Well it is time to announce a change of name to a nicer one!\n\nYou probably don't know but before \"Genoma Games\", we we...","slug":"2018/04/new-name","title":"A change of face"},{"content":"\n# New Prototype Available!\n\nHell yeah from now on you can [play the new version of **Arkapongout**](https://zombie-unicorn.itch.io/arkapongout)!\n\n### What's new?\n\n- **Lives:** Now you'll have 3 lives to spend trying to win the game\n- **Power Ups:** There's a probability that when you break a brick it drops a power up to help you succeed.\n- **Keyboard controls:** Ready to manage the paddle with your keyboard?\n- **Sounds:** A delightful set of sounds has been added to the game\n- **Pixel Graphics:** All the UI has been redesigned to be pixel art style\n- **Improve Ball management:** Now the ball will react better when you hit it with the paddle extremes.\n- **Lazy Ball:** The ball velocity has been reduce to let someone win the game (Hope you make it).\n- **Immortal briks:** Don't worry they aren't in the current level\n\n### What now?\n\nNow is time to prepare the **next version**. And probably it would have this things:\n\n- Improved level design\n- More levels\n- More level ups\n- Visual improvements\n- Music?\n\n---\n\nSee you in in the next release!\n","coverImage":null,"date":1494979200000,"draft":false,"summary":"Hell yeah from now on you can play the new version of Arkapongout!\n\nWhat's new?\n\nLives: Now you'll have 3 lives to spe...","slug":"2017/05/new-prototype-available","title":"New Prototype Available!"},{"content":"\n# Up And Sliding\n\nThis is so exciting!!! and it is just the beginning...\n\nSo this is the first post and the presentation of a new game **Arkapongout**, if you don't need an explanation for what kind of game it I already like you and if you don't... well don't worry, it happens! the shortest way to describe it is\n\n### [Arkanoid](https://en.wikipedia.org/wiki/Arkanoid) + [Pong](https://en.wikipedia.org/wiki/Pong) + [Breakout](https://en.wikipedia.org/wiki/Breakout)\n\nYup, pretty much that three words (And links to their definition if you still not knowing them) say everything about the game and its mechanics.\n\n![Arkapongout Prototype 1 Version](/posts/assets/ghost-posts-images/2017/05/arkapongout-00.png)\n\nUp there you can see a picture with the current stage of the game, as you can see it is in a very simple **prototype** with no so mutch mechanics, graphics or features, let's be honest, there's is nothing innovative yet in the game but it's playable.\n\nBut don't be sad about that simplicity, It will receive much more improvements, features and new mechanics.\n\n### [Play It!](https://zombie-unicorn.itch.io/arkapongout)\n\nYes!!! You read that right, **you can play it now** and rage over it on the comments (but please, be kind).\n\nJokes apart, feel free to **request any improvements as well as report bugs**. You can reach me by the [itch.io comments](https://zombie-unicorn.itch.io/arkapongout), by submitting issues in the [Game GitHub project](https://github.com/ZombieUnicornStudio/Arkapongout/issues) or [@Arkapongout on twitter](https://twitter.com/arkapongout).\n\n### What's Next?\n\nWell the next changes for the game are [drumroll]:\n\n- Life system\n- Better ball control\n- Different brick types\n- A Few FX Sounds\n- Power Ups!\n\nStay tuned to new updates!\n\n#### Extra Info\n\nThis is my **first serious game**, I have no idea to charge money to play it yet, I think it depends how much value it gains over the time, but not in a short term.\n\nI'll try to **publish** one new version as well a little entry of what has changed in the game **each 2 weeks or once a month**, It'll depend on the amount of work and my free time.\n\nThe game is only being developed by [**me**](http://onlythepixel.com) but it could change over the time (I enjoy a lot working in team, so feel free to contact me if you want to collaborate). A con is that the speed of development will be slow and probably sometimes the changes will not be so big but let's have patience on this. This is because I'm **developing the game in my free time** so sometimes I'll not being able to spend all the time I want on it [picture my sad face in your mind].\n\nBall out! See you in the next launch!\n","coverImage":null,"date":1494115200000,"draft":false,"summary":"This is so exciting!!! and it is just the beginning...\n\nSo this is the first post and the presentation of a new game A...","slug":"2017/05/up-and-sliding","title":"Up And Sliding"},{"content":"\n# Our First Game (Jam) It's Alive!\n\nSo so so! It's been a long time since I wrote the last post of this dusty blog about our promising studio logo. Ah... I remember those days, I was thinking that start being an indie developer would be easy, and it is if you do not do nothing about game dev...\n\nWell, this time I'm writing here to show you, whoever you are, wherever you are and whenever you read this...\n\n<h3 style=\"text-align: center;\">OUR FIRST GAME!</h3>\n\nOh yeah! We have developed a **complete game** (sadly that game is not _The Seeker_) for the first time, and I'm pretty sure that this was unbelievable the day we started that development. The development of this game was made in a [**Game Jam**](https://en.wikipedia.org/wiki/Game_jam) organized by me 2 months before the proposed Game Jam date. And that's why I'm writing this post, to talk about that journey.\n\n### Preparing a Game Jam with Friends\n\nYou read right, our first Game Jam was organized with friends who also are developers.\n\nAs I said I arranged the date with 2 months in advance to be sure that all this geeky people (6 in total) were able to lend their brains to develop some _entertainment program_ in 2 days and a half (Probably that anticipation would had been lesser if Christmas wasn't in the middle).\n\nOne of the most important thing of this process (from my point of view) was to make sure that the guys who were going to participate in the Game Jam did not see it as an obligation, focus it so that it is known that the **main objective is to have fun and spend a good time with friends**.\n\nThe other thing of this process is to **be sure that no one thought we were going to go with a pre-set topic** (even the organizer), no resuming old development, no brilliant game ideas, no roles defined, just fun. From here it's just wait till the Game Jam weekend.\n\n#### First Day First Contact\n\nThe time passed and the day came clean minds in a single house prepared to breed a little game! Sadly, only 3 of us were present that day, no problem, let's dev!\n\nSo we started on Friday evening designing a way to get a game definition without pre-defined ideas. We cut a bunch of papers and created **4 different decks** with them. One with **mechanics** (jump, life, death, melee, shoot, loot, interactions with environment, etc.), other with **topics** (thriller, exploration, horror, adventure, sports, etc.) another one with **visual themes**, for this one we used [Stormdeck](http://www.stormdeck.com/) that has good ideas (Steampunk, Future Tech, Pixel Art, Depict, Low Poly, etc.) and a last one with different **color palettes**, we also used Stormdeck for this one.\n\nThen we discarded the cards that we didn't like and finally we choose randomly one of each other creating groups, so for example we had a Sports game with teleporting in negative color. Starting from this groups we discarded a few and then we choosed 2 of the remaining.\n\nThis is what we get!\n\n![](/posts/assets/ghost-posts-images/2017/02/425806014_163168_8236750835511981787.jpg)\n_**Note:** Some names are in Spanish because our native language is Español, amigo!_\n\nFrom here we started to bake some **very basic idea just using one topic and one mechanic** leaving apart the visual content at the moment, just to do prototyping.\n\nAt the moment we began to feel ok with the idea, we started the development over it.\n\n#### Everyone Paddling with the same Paddle\n\nOne of the problem was that **only 2 of us know the engine** ([Unity3D](http://unity3d.com/)) we were developing with for this game, so we started this process by doing [pair programming](https://en.wikipedia.org/wiki/Pair_programming) (but this time 4 people programing) till the others started feeling comfortable with the engine.\n\nThis was important for the team, the fact that anyone could did anything for the game (ones faster/better than others, but this did matter) gave the team freedom to choose their roles or to take decisions over the development actions.\n\nAt the time someone first joined the game jam, if he had no idea of Unity, some of us did pair programing with him until he felt comfortable with the tool.\n\n#### And then the Levels come\n\nOnce that we had **something that a game designer could work with**, all of us started making a level each one focusing on the mechanics and topics, we set a timer of 30 minutes to design a whole level with an extra 5 minutes to polishing. When the timer came to an end each one played other's level. This was amazing, each of us ended with something **completely different and awesome** even that we were using the same assets and the same mechanics. This process helped us to discover new ways to improve our levels by merging or reusing other's ideas.\n\n![](/posts/assets/ghost-posts-images/2017/02/ItsAliveLevel.jpg)\n\nDuring this _play testing_ we point out the bugs detected. Then, we **made a review of each level**, What is the best of that level? What could be improved? What feelings does that level evoke?, etc.\n\n#### Arrange > Make > Design > Play > Review > Repeat\n\nSo we improvised our **brand new Game Jam Workflow**:\n\n1. Define what assets and mechanics we would like to have on that iteration\n1. Develop/make those tools/assets and improve the current ones fixing bugs and adding features\n1. Design/improve a level with this new assets (don't work again in the same level you did last iteration, instead, work on other's level)\n1. Play/Test the new/modified levels\n1. Review the changes find bugs improvements and set the new things you would like to got the next iteration\n1. Repeat till you have time!\n\n#### Last Hours\n\nAt the end of the weekend we had 6 different levels with a bunch of cool stuff so we spend the last hours of the Game Jam to polish all of this. No more new developments, just bug fixing, menus, music, sounds, sprites.\n\nIn short, **make it look like a finished game**.\n\nAnd it was!\n\n![](/posts/assets/ghost-posts-images/2017/02/ItsAliveLevel1.jpg)\n\n### It's Alive\n\nSo we ended with a simple game that has bring us a lot of knowledge and fun for a whole weekend.\n\n![](/posts/assets/ghost-posts-images/2017/02/ItsAliveMainMenu.jpg)\n\nAnd that's true, **Zombie Unicorn is alive!** we are not so dead yet (do not pay attention to our logo as reference) and we are boiling those neurons to make the most juicy game soup you've ever taste. This was the push needed to make the studio oils its gears and start the magic.\n\nStop the chatter and show the game!\n\n**Play it on [It's Alive itch.io page](https://zombie-unicorn.itch.io/its-alive)**\n\n#### After Game Jam\n\nAfter the Game Jam we did a retrospective about what we liked and what we want to improve for next times. The general feeling was to **be proud of finish a game completely** but due the lack of knowledge in the technologies used during the Game Jam it caused feelings of **spending the time learning instead of developing** losing the opportunity to improve more the game (from a more commercial point of view).\n\n#### Game Jam Gold Rules\n\nThis is my personal opinion and it could be different from the participants of this game jam or other game creators, but from my point of view this are the **rules to have a nice and fun Game Jam**:\n\n- **Do not pre-set anything before start** about the game. Try to keep your mind clean before starting the Game Jam.\n- **Use some method to get the specifications** of the game, random preferably. Do not choose directly what game you want to make.\n- **Iterate in very small time slots**. For example, 1h of dev/making, 30min lvl design, 20min review and planification.\n- **Do not focus in all the game specifications from the start**. Start by picking and making only one mechanic and one topic and then build over this ones bit by bit.\n- **Save last hours for polishing**. Stop the development a few hours before the Game Jam ends to start polishing what you have, and make it look like a game.\n\n> **Special thanks to the creators!**\n>\n> [Matto](https://twitter.com/mattogodoy), [Bernart](https://twitter.com/depablobernat), [Victor](https://twitter.com/victorgb6), [Carlos](https://twitter.com/The_Pretender86), [Adrian](https://twitter.com/adriandelarosab) and [Alberto (me)](https://twitter.com/AlbertoFdzM)\n\n**Good Game & Have Fun!**\n","coverImage":null,"date":1486598400000,"draft":false,"summary":"So so so! It's been a long time since I wrote the last post of this dusty blog about our promising studio logo. Ah......","slug":"2017/02/our-first-game-jam-its-alive","title":"Our First Game (Jam) It's Alive!"},{"content":"\n# Studio Logo Released!\n\nHey guys!\n\nThis time is my turn to write an entry due that [@matto](https://twitter.com/mattogodoy), our beloved developer is outside of the country (and not for _immigration issues_).\n\nWell this entry is going to be short but awesome because I'm going to show you our brand new **studio logo**!!!\n\nAnd here it is!\n\n![Zombie Unicorn Logo](/posts/assets/ghost-posts-images/2016/03/StudioLogo.png)\n\nUnpredictable uh? yeah... I know...\n\nActually this entry is because I feel lonely... so lonely.\n\nPlease **comment**! Say what do you think about our logo, what you think would be nice to do with it or just tell us your life, cheers!\n","coverImage":null,"date":1459296000000,"draft":false,"summary":"Hey guys!\n\nThis time is my turn to write an entry due that @matto, our beloved developer is outside of the country (an...","slug":"2016/03/studio-logo-released","title":"Studio Logo Released!"},{"content":"\n# Some progress\n\nWe have made some progress in the game and we have also defined it's name!\n\nThe name is:\n\n_... drum roll..._\n\n# The Seeker\n\nWe hope you like it. We think it fits the theme of the game, and it does even have a song written by The Who!\n\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/142316852&amp;color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false\"></iframe>\n\nNow, this is where we are in development now:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/cMOva2ZDnGo?rel=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen></iframe>\n\nSome of the changes:\n\n- Better blood sprites and animations\n- Grenades, explosions and throwing animations\n- Running\n- Background sprites (walls, doors, furniture, etc.)\n- Pickable items (guns, ammo, first aid kit)\n\n... and much more.\n\nWe'll keep you posted!\n","coverImage":null,"date":1457539678000,"draft":false,"summary":"We have made some progress in the game and we have also defined it's name!\n\nThe name is:\n\n... drum roll...\n\nThe Seeker...","slug":"2016/03/some-progress","title":"Some progress"},{"content":"\n# Clarification\n\nThe main character we're using right now is not ours. It has been designed by [Asthree Works](http://asthreeworks.com/) as an early stage of one of the guards for their awesome game [Paradise Lost](http://asthreeworks.com/games-paradise-lost-first-contact/).\n\n![](/posts/assets/ghost-posts-images/2016/03/Screen-Shot-2016-03-09-at-16-40-15.png)\n\nWe copied it to use it as a placeholder while we decided who our main character was going to be. We already know, but it's a surprise :)\n\nTo keep things clear, we contacted the guys at Asthree and asked them if they where ok with this. They where very cool about it and let us keep the images in this site while we define our own character.\n\nMaybe you continue to see more animations or images in which this character appears, but he will be replaced shortly.\n\nTo thank the guys at Asthree, go and pre-order Paradise Lost at their [store](http://asthreeworks.com/store/). You won't regret.\n\nBye!\n","coverImage":null,"date":1457538658000,"draft":false,"summary":"The main character we're using right now is not ours. It has been designed by Asthree Works as an early stage of one o...","slug":"2016/03/clarification","title":"Clarification"},{"content":"\n# Death animations\n\nThis is how zombies die (again):\n\n<iframe src='https://gfycat.com/ifr/IllinformedDimpledEnglishsetter' frameborder='0' scrolling='no'></iframe>\n\nAnd this is how you die if a zombie hears you:\n\n<iframe src='https://gfycat.com/ifr/BasicSandyAmbushbug' frameborder='0' scrolling='no'></iframe>\n\nWe like bloodbaths!\n","coverImage":null,"date":1456498573000,"draft":false,"summary":"This is how zombies die (again):\n\n\n\nAnd this is how you die if a zombie hears you:\n\n\n\nWe like bloodbaths!...","slug":"2016/02/death-animations","title":"Death animations"},{"content":"\n# Stabbing zombies\n\nYou can stab those damn zombies now!\n\n<iframe src='https://gfycat.com/ifr/NextKindDodobird' frameborder='0' scrolling='no'></iframe>\n\nThis is very useful specially when zombies haven't seen you. If you stab them in the back, they die instantly. If you stab them in the front, it will take a few hits for you to kill 'em:\n\n<iframe src='https://gfycat.com/ifr/IdealisticSeparateGreathornedowl' frameborder='0' scrolling='no'></iframe>\n\nTo avoiding being heard when you approach a zombie, you have to go stealth. Otherwise they will hear you and try to attack.\n\nAlso, if you shoot, all of the zombies nearby will go to the source if the sound.\n\nSuggestions?\n","coverImage":null,"date":1456497992000,"draft":false,"summary":"You can stab those damn zombies now!\n\n\n\nThis is very useful specially when zombies haven't seen you. If you stab them...","slug":"2016/02/stabbing-animation","title":"Stabbing zombies"},{"content":"\n# Assault rifle shooting animation\n\nThis is how our assault rifle shoots. Scary, huh?\n\n<iframe src='https://gfycat.com/ifr/DiscreteForsakenCoelacanth' frameborder='0' scrolling='no'></iframe>\n\nAny suggestion?\n","coverImage":null,"date":1456496503000,"draft":false,"summary":"This is how our assault rifle shoots. Scary, huh?\n\n\n\nAny suggestion?...","slug":"2016/02/assault-rifle-shooting-animation","title":"Assault rifle shooting animation"}],"totalPages":3},"__N_SSG":true}