{"pageProps":{"currentPage":3,"posts":[{"content":"\n# Picking up items\n\nThis is the animation for picking up items. Each item takes different time to pick it up. This can put you in a scenario in which you will have to decide if you risk your life (or the survivor you're leading) to pick up an item.\n\n<iframe src='https://gfycat.com/ifr/DopeyAbsoluteDrongo' frameborder='0' scrolling='no'></iframe>\n\nTell us what you think!\n","coverImage":null,"date":1456490881000,"draft":false,"excerpt":"This is the animation for picking up items. Each item takes different time to pick it up. This can put you in a scenar...","slug":"2016/02/picking-up-items","title":"Picking up items"},{"content":"\n# Pistol shooting animation\n\nThese are the shooting and idle animations for the pistol. Bullet shells come out of the gun when shooting, and when reloading, the magazine falls out.\n\n<iframe src='https://gfycat.com/ifr/TimelyGloomyEgret' frameborder='0' scrolling='no'></iframe>\n\nA reloading animation is still pending.\n\nComments are always welcome!\n","coverImage":null,"date":1456489927000,"draft":false,"excerpt":"These are the shooting and idle animations for the pistol. Bullet shells come out of the gun when shooting, and when r...","slug":"2016/02/pistol-shooting-animation","title":"Pistol shooting animation"},{"content":"\n# Ahoy!\n\nThis is the beginning of a ~~bumpy~~ awesome road.\n\nWe're starting as an independent video game studio and we are already working on our first game!\nWe still don't have a name for it (maybe **you can help us with that**), but all we know is that it's going to be _superb_.\n\n## Who are we?\n\nWe are two developers and co-workers in Madrid, Spain trying to shift our futures to the world of indie game development. We know it's not easy but «no pain, no gain», right?\n\n##### Matto Godoy\n\n![](/assets/ghost-posts-images/2016/02/Matto.png)\n\nDeveloper of everything you put in front of him and professional hater.\n\n- Personal website: [https://matto.io](https://matto.io)\n- Twitter: [@mattogodoy](https://twitter.com/mattogodoy)\n\n##### Alberto Fernandez\n\n![](/assets/ghost-posts-images/2016/02/Albert.png)\n\nDeveloper, pixel artist and unsuccessful comedian.\n\n- Personal website: [https://onlythepixel.com/](https://onlythepixel.com/)\n- Twitter: [@albertofdzm](https://twitter.com/albertofdzm)\n\n## The studio\n\nBy now, **Zombie Unicorn Studio** exists only virtually since we don't have a physical studio, but we hope that's an issue to be solved shortly.\n\nDon't miss any tweet! [@ZombieUnicornSt](https://twitter.com/ZombieUnicornSt)\n\nIf you want to contact us, you can do so via email: **info@zombieunicorn.studio**\n\n## What will you play?\n\nYou are a soldier that survived a zombie apocalypse, and your mission will be to move through some abandoned buildings in the city to rescue other survivors.\n\nYou will have to find them and safely lead them to an exit, from which you will be picked up and taken to a safe zone.\n\n## What will we do?\n\nWe will be showing up some updates about our game, including ideas, animations, problems we find, and all kind of related content.\n\nWe encourage you to give us all the feedback you can. Let us know what would make a game that you'd love to play so we can make it for you!\n\nStay tuned.\n","coverImage":null,"date":1456489624000,"draft":false,"excerpt":"This is the beginning of a ~~bumpy~~ awesome road.\n\nWe're starting as an independent video game studio and we are alre...","slug":"2016/02/ahoy","title":"Ahoy!"}],"totalPages":3},"__N_SSG":true}