{"pageProps":{"post":{"content":"<p>This is the <strong>first devlog</strong> for the <strong>new project</strong> codenamed <strong>P2D</strong> I'm working on. It's still a prototype more than a game and I'm yet trying to find the correct mechanics for the gameplay experience I'm looking for.</p>\n<h3 id=\"tldr\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#tldr\"><span class=\"icon icon-link\"></span></a>TL;DR</h3>\n<p>I removed all my gamedev progress and started from zero.</p>\n<p><strong>New mechanics!</strong></p>\n<ul>\n<li><strong>Movement</strong>: The player can move around with his legs.</li>\n<li><strong>Jumping</strong>: The player jump around with his legs.</li>\n<li><strong>Camera Follow</strong>: There will be some magic entity that will follow you very smoothly filming whatever you're doing.</li>\n<li><strong>Health</strong>: The player have health, is a living thing</li>\n<li><strong>Damage</strong>: The player can be damaged losing health</li>\n<li><strong>Dead</strong>: The player can die respawning where he started the level</li>\n</ul>\n<p><strong>New gameplay experiences!</strong></p>\n<ul>\n<li><strong>Move and jump</strong> around the world with the smoothest <strong>camera follow</strong> ever.</li>\n<li>Currently the only thing that could <strong>kill you</strong> is <strong>fall damage</strong>.</li>\n</ul>\n<p>Scroll down to see some screenshots and GIFs!</p>\n<h3 id=\"wiping-the-dust\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#wiping-the-dust\"><span class=\"icon icon-link\"></span></a>Wiping the Dust</h3>\n<p>This project has some past. Here is some old stuff I did time ago before sticking to something simpler:</p>\n<img src=\"/posts/assets/ghost-posts-images/2018/04/Concept.png\" alt=\"Old Concept Art\">\n<p>I get to implement those tiles and the main character and some animations but the thing is that I last too much in finishing this assets and the feeling were of doing slow progress. So I decided to dump all the progress I did and start clean with a simpler idea and very basic mechanics.</p>\n<h3 id=\"clean-start\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#clean-start\"><span class=\"icon icon-link\"></span></a>Clean Start</h3>\n<p>I did a character concept with a small pixel ratio and a few animations, which let me spend less but enough time doing art:</p>\n<img src=\"https://i.imgur.com/sDojV70.gif\" alt=\"Player First Animations\">\n<p>And then I create a small level concept animated by hand:</p>\n<img src=\"https://i.imgur.com/0U2gb8F.gif\" alt=\"First Game Concept Animation\">\n<p>With this assets I could make a very very simple game, but was enough for me to keep with the project without losing enthusiasm. What I also did was spamming my friends and teammates with my progress in the game, this helped me a lot since any bit of attention were a pretty good point to continue with the project.</p>\n<p>Also at the same time Unity released the <a href=\"https://unity3d.com/es/learn/tutorials/s/2d-game-kit\" rel=\"nofollow\">2D Game Kit</a> to help people without code knowledge start developing 2D games. Guess what? I have a small experience with Unity3D and C# programming but I took advantage of this and used some of their scripts to have some things working without losing too much time thinking, like the respawn logic or the scene controller.</p>\n<h3 id=\"core-mechanics\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#core-mechanics\"><span class=\"icon icon-link\"></span></a>Core Mechanics</h3>\n<p>I defined in a flowchart the <strong>core mechanics</strong> of the game (movement, jump, camera follow, health, damage and dead) with small descriptions of what I want this mechanics to be like. I also spend some time defining some game history like how the world is, what is going on or some superadvanced mechanics, just for fun and to see a bit of the big picture and not get bored with simpler stuff.</p>\n<h3 id=\"results\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#results\"><span class=\"icon icon-link\"></span></a>Results</h3>\n<p>With my core mechanics defined I started developing the game with some of the core mechanics. I've end up having a small prototype where you can move around with this character (name to be defined) jumping over a bunch of platforms made from the same tileset, testing how the game feels and gathering as much feedback as I can from the people that played it.</p>\n<p>Once I had the health, damage and dead mechanics I implemented <strong>fall damage</strong>. If you fall from a great height you'll die:</p>\n<img src=\"https://i.imgur.com/u6K4jyV.gif\" alt=\"Implemented Fall Damage\">\n<p>Then I implemented level transitions to load new areas:</p>\n<img src=\"https://i.imgur.com/cpdLGT6.gif\" alt=\"Zone Swapping\">\n<p>And finally a small <strong>Start Menu</strong> to have something that feels more like a game:</p>\n<img src=\"https://i.imgur.com/gXJXsZt.png\" alt=\"Start Menu\">\n<h3 id=\"now-what\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#now-what\"><span class=\"icon icon-link\"></span></a>Now what?</h3>\n<p>Now I iterate over and over and over until having a game. Next thing to make will probably be:</p>\n<ul>\n<li>Attack</li>\n<li>Health Points</li>\n<li>Destructibles</li>\n<li>Collectables</li>\n<li>A new tileset</li>\n</ul>\n<h3 id=\"stay-tuned\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#stay-tuned\"><span class=\"icon icon-link\"></span></a>Stay Tuned</h3>\n<p>You can follow the project progress on:</p>\n<ul>\n<li><a href=\"https://twitter.com/GenomaGames\" rel=\"nofollow\">Twitter @GenomaGames</a></li>\n<li><a href=\"https://genomagames.imgur.com/\" rel=\"nofollow\">Imgur</a></li>\n<li><a href=\"https://genomagames.tumblr.com\" rel=\"nofollow\">Tumblr</a></li>\n<li><a href=\"https://genomagames.itch.io/project-p2d\" rel=\"nofollow\">Itch.io</a></li>\n<li><a href=\"https://genomagames.gamejolt.io/project-p2d\" rel=\"nofollow\">Game Jolt</a></li>\n</ul>","coverImage":null,"date":1524096000000,"draft":false,"summary":"This is the first devlog for the new project codenamed P2D I'm working on. It's still a prototype more than a game and...","slug":"2018/04/p2d-devlog-v0-1-0-getting-started","title":"P2D Devlog v0.1.0 Getting Started"}},"__N_SSG":true}