{"pageProps":{"post":{"content":"\n# Up And Sliding\n\nThis is so exciting!!! and it is just the beginning...\n\nSo this is the first post and the presentation of a new game **Arkapongout**, if you don't need an explanation for what kind of game it I already like you and if you don't... well don't worry, it happens! the shortest way to describe it is\n\n### [Arkanoid](https://en.wikipedia.org/wiki/Arkanoid) + [Pong](https://en.wikipedia.org/wiki/Pong) + [Breakout](https://en.wikipedia.org/wiki/Breakout)\n\nYup, pretty much that three words (And links to their definition if you still not knowing them) say everything about the game and its mechanics.\n\n![Arkapongout Prototype 1 Version](/assets/ghost-posts-images/2017/05/arkapongout-00.png)\n\nUp there you can see a picture with the current stage of the game, as you can see it is in a very simple **prototype** with no so mutch mechanics, graphics or features, let's be honest, there's is nothing innovative yet in the game but it's playable.\n\nBut don't be sad about that simplicity, It will receive much more improvements, features and new mechanics.\n\n### [Play It!](https://zombie-unicorn.itch.io/arkapongout)\n\nYes!!! You read that right, **you can play it now** and rage over it on the comments (but please, be kind).\n\nJokes apart, feel free to **request any improvements as well as report bugs**. You can reach me by the [itch.io comments](https://zombie-unicorn.itch.io/arkapongout), by submitting issues in the [Game GitHub project](https://github.com/ZombieUnicornStudio/Arkapongout/issues) or [@Arkapongout on twitter](https://twitter.com/arkapongout).\n\n### What's Next?\n\nWell the next changes for the game are [drumroll]:\n\n- Life system\n- Better ball control\n- Different brick types\n- A Few FX Sounds\n- Power Ups!\n\nStay tuned to new updates!\n\n#### Extra Info\n\nThis is my **first serious game**, I have no idea to charge money to play it yet, I think it depends how much value it gains over the time, but not in a short term.\n\nI'll try to **publish** one new version as well a little entry of what has changed in the game **each 2 weeks or once a month**, It'll depend on the amount of work and my free time.\n\nThe game is only being developed by [**me**](http://onlythepixel.com) but it could change over the time (I enjoy a lot working in team, so feel free to contact me if you want to collaborate). A con is that the speed of development will be slow and probably sometimes the changes will not be so big but let's have patience on this. This is because I'm **developing the game in my free time** so sometimes I'll not being able to spend all the time I want on it [picture my sad face in your mind].\n\nBall out! See you in the next launch!\n","coverImage":null,"date":1494115200000,"draft":false,"summary":"This is so exciting!!! and it is just the beginning...\n\nSo this is the first post and the presentation of a new game A...","slug":"2017/05/up-and-sliding","title":"Up And Sliding"}},"__N_SSG":true}