{"pageProps":{"post":{"content":"\n# P2D Devlog v0.4.0 - Player Mechanics Improvements and Game World Outlining\n\nAnother step towards a better game! This one almost appears to be a step back, the created scenes have been removed but in exchange, there is a huge world to be shaped.\n\nYou can check the [previous devlog](/p2d-devlog-v0-3-0-enemies-and-new-location/) if you missed it.\n\n## TL;DR;\n\n- Defined the outline of the game world waiting to be shaped\n- Improve player movements, now jumping, running and attacking feel more organic\n- The player can now attack while on air\n- Now the game loads the areas progressively without load screens\n- Implemented a pause menu\n- Now the game works on iPhone and Android and it will run at 60fps\n- The whole game logic has been improved (game management, inputs, menus, enemies...)\n\n> Don't miss the GIFs! Scroll a little bit\n\n## Detail\n\nThe biggest change in this version is **the world** and the **level progression mechanic** followed by improvements in several game mechanics and systems (a better core a better game)\n\n### The World\n\nThe whole world outline has been designed, meaning that now the game can be played from beginning to end, there's no content yet so the player walks along plain and empty landscapes ready to be shaped with more interesting forms and to be filled with enemies, objects, decoration...\n\n![Whole World Outline](https://i.imgur.com/sBa4xAd.gif)\n\nYou can complete the game as it is now in around 15 minutes. Now the challenge is to fill and expand that time width fun and challenging scenery.\n\n### The new level loading system\n\nThe old screen fading to change between levels has been replaced for a progressive loading system. No more loading screens.\n\n![New Level Loading System](https://i.imgur.com/lYso4er.gif)\n\nAlthough it is likely that the screen fade system will be used to pass through doors.\n\n### Movement Improvements\n\nThe movement logic has been changed to be a little more organic. The player and other walking things now have a small acceleration time, this allows the player to make more precise movements.\n\n![Player Movement Improves](https://i.imgur.com/IDUkZBE.gif)\n\nIt could be improved more but at this moment it's fine.\n\n### Air Attack!\n\nIn the previous version the game included a new type of enemy (bats), now the player can fight them by attacking while jumping.\n\n![Player now can attack while on air](https://i.imgur.com/iKHQIBl.gif)\n\n### Menus\n\nA new pause menu has been added to access to the main menu while on gameplay (or to take a break)\n\n![Pause Menu](https://i.imgur.com/5rpZXGp.gif)\n\n## Nobody thinks in the future?\n\nThe plan now is:\n\n- Forest zone levels content\n- Dungeon zone levels content\n- Work on the game world and leveling\n- More enemies\n- New mechanics\n\n## Don't miss it!\n\nYou can find out earlier about these changes in [@GenomaGames](https://twitter.com/GenomaGames)\n\n<!--kg-card-end: markdown-->\n","coverImage":null,"date":1541030400000,"draft":false,"excerpt":"Another step towards a better game! This one almost appears to be a step back, the created scenes have been removed bu...","slug":"2018/11/p2d-devlog-v0-4-0-player-mechanics-improvements-and-game-world-outlining","title":"P2D Devlog v0.4.0 - Player Mechanics Improvements and Game World Outlining"}},"__N_SSG":true}